(1) 모듈 로딩

In [1]:
import pandas as pd
import numpy as np

(2) 데이터 불러오기

In [4]:
file = "../DATA/chicago_food_inspections.csv"
chicagoDF = pd.read_csv(file)
chicagoDF["Name"].head()

0     MARRIOT MARQUIS CHICAGO
1                    JETS PIZZA
2                     ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                  CHARTWELLS
Name: Name, dtype: object

In [6]:
chicagoDF["Name"].head().values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [7]:
chicagoDF["Name"].str

<hr> 예제 <hr>

In [10]:
dessert = "   cheesecake   "
dessert.lstrip(), dessert.rstrip(), dessert. strip()

('cheesecake   ', '   cheesecake', 'cheesecake')

<hr>

In [11]:
chicagoDF["Name"].str.lstrip().head()

0    MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3     MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [12]:
chicagoDF["Name"] = chicagoDF["Name"].str.strip()

In [13]:
chicagoDF.columns

Index(['Name', 'Risk'], dtype='object')

In [14]:
for column in chicagoDF.columns:
    chicagoDF[column] = chicagoDF[column].str.strip()

In [16]:
chicagoDF['Name'].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

<hr>

In [17]:
steaks = pd.Series(['porterhouse', 'filet mignon', 'ribeye'])
steaks

0     porterhouse
1    filet mignon
2          ribeye
dtype: object

In [18]:
steaks.str.upper()

0     PORTERHOUSE
1    FILET MIGNON
2          RIBEYE
dtype: object

<hr>

In [19]:
chicagoDF["Name"].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [20]:
chicagoDF["Name"].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

<hr>

In [21]:
chicagoDF['Risk'].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: object

In [22]:
len(chicagoDF)

153810

In [23]:
chicagoDF['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [25]:
chicagoDF = chicagoDF.dropna(subset = ["Risk"])

In [26]:
chicagoDF["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

In [27]:
chicagoDF = chicagoDF.replace(to_replace = 'All', value = "Risk 4(Extreme)")

In [28]:
chicagoDF["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4(Extreme)'], dtype=object)

In [29]:
chicagoDF["Risk"].str.slice(5,6).head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [31]:
chicagoDF["Risk"].str[5:6].head() #위의 구문과 같은 결과 반환

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [32]:
chicagoDF['Risk'].str.slice(8).head() #chicagoDF['Risk'].str.[8:].head()

0      High)
1    Medium)
2       Low)
3      High)
4      High)
Name: Risk, dtype: object

In [33]:
chicagoDF["Risk"].str.slice(8,-1).head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [37]:
chicagoDF["Risk"].str.slice(8).str. replace(")", " ").head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

<hr> bullean method<hr>예제<hr>

In [38]:
"Pizza" in "Jets Pizza"

True

In [39]:
"pizza" in "Jets Pizza"

False

<hr>

In [40]:
chicagoDF['Name'].str.lower().str.contains('pizza').head()

0    False
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [42]:
has_pizza = chicagoDF["Name"].str.lower().str.contains('pizza')

In [43]:
chicagoDF[has_pizza]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [44]:
chicagoDF["Name"].str.lower().str.startswith("tacos").head()

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [45]:
starts_with_tacos=(chicagoDF['Name'].str.lower().str.startswith('tacos'))
chicagoDF[starts_with_tacos]

                         Name           Risk
69               TACOS NIETOS  Risk 1 (High)
556       TACOS EL TIO 2 INC.  Risk 1 (High)
675          TACOS DON GABINO  Risk 1 (High)
958       TACOS EL TIO 2 INC.  Risk 1 (High)
1036      TACOS EL TIO 2 INC.  Risk 1 (High)
...                       ...            ...
143587          TACOS DE LUNA  Risk 1 (High)
144026           TACOS GARCIA  Risk 1 (High)
146174        Tacos Place's 1  Risk 1 (High)
147810  TACOS MARIO'S LIMITED  Risk 1 (High)
151191            TACOS REYNA  Risk 1 (High)

[105 rows x 2 columns]

In [46]:
ends_with_tacos=(chicagoDF['Name'].str.lower().str.endswith('tacos'))
chicagoDF[ends_with_tacos]

                   Name           Risk
382        LAZO'S TACOS  Risk 1 (High)
569        LAZO'S TACOS  Risk 1 (High)
2652       FLYING TACOS   Risk 3 (Low)
3250       JONY'S TACOS  Risk 1 (High)
3812       PACO'S TACOS  Risk 1 (High)
...                 ...            ...
151121      REYES TACOS  Risk 1 (High)
151318   EL MACHO TACOS  Risk 1 (High)
151801   EL MACHO TACOS  Risk 1 (High)
153087  RAYMOND'S TACOS  Risk 1 (High)
153504        MIS TACOS  Risk 1 (High)

[304 rows x 2 columns]

<hr>

In [47]:
customers = pd.read_csv("../DATA/customers.csv")
customers. head()

                  Name                                            Address
0        Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1    Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2      Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3  Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4       Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...

In [48]:
customers['Name'].str.len().head()

0    13
1    17
2    15
3    19
4    14
Name: Name, dtype: int64

<hr>

In [50]:
phone_number = '555-123-4567'
phone_number.split('-')

['555', '123', '4567']

In [52]:
customers["Name"].str.split(pat = ' ').head()
customers['Name'].str.split(' ').head()

0           [Frank, Manning]
1       [Elizabeth, Johnson]
2         [Donald, Stephens]
3    [Michael, Vincent, III]
4          [Jasmine, Zamora]
Name: Name, dtype: object

In [53]:
customers['Name'].str.split(' ').str.len().head()

0    2
1    2
2    2
3    3
4    2
Name: Name, dtype: int64

In [55]:
customers['Name'].str.split(pat = ' ', n=1).head()

0          [Frank, Manning]
1      [Elizabeth, Johnson]
2        [Donald, Stephens]
3    [Michael, Vincent III]
4         [Jasmine, Zamora]
Name: Name, dtype: object

In [57]:
customers['Name'].str.split(pat = ' ', n =1).str.get(1).head() #각 리스트 안의 요소(이름)에서 성(두 번째 요소: 컴퓨터는 제로베이스!)

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [58]:
customers["Name"].str.split(pat = ' ',n =1).str.get(-1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [59]:
customers['Name'].str.split(pat = ' ', n =1, expand = True).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

In [60]:
customers["Name"].str.split(pat = " ", expand = True).head() # 매개변수  n으로 분할 개수 제한하지 않으면 요소가 불충분한 값에 None 배치

           0         1     2
0      Frank   Manning  None
1  Elizabeth   Johnson  None
2     Donald  Stephens  None
3    Michael   Vincent   III
4    Jasmine    Zamora  None

In [61]:
customers[['First Name', 'Last Name']] = customers["Name"].str.split(pat = ' ',n = 1,expand = True)

In [62]:
# 열 삭제하기
customers = customers.drop(labels = "Name", axis = "columns")

In [63]:
customers.head()

                                             Address First Name    Last Name
0  6461 Quinn Groves, East Matthew, New Hampshire...      Frank      Manning
1  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...  Elizabeth      Johnson
2  19120 Fleming Manors, Prestonstad, Montana, 23495     Donald     Stephens
3       441 Olivia Creek, Jimmymouth, Georgia, 82991    Michael  Vincent III
4  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...    Jasmine       Zamora